/*Создать новый проект. Создать класс с методом main.
В методе main написать код выводящий ваше ФИО, номер телефона, адрес.**/
public class Ex_1 {
        String name = "Вера Йост; ";
        String adress = "Bottinger Straße 15a, March; ";
        String telefon = "89515181051.";


public Ex_1(){
    System.out.println("Имя: " + name + "Адрес: " + adress + "Телефон: " + telefon);

};
}
