/*Создать приложение, в котором есть две целочисленные переменные
(задаются в коде, не нужно считывать из консоли), и на экран необходимо вывести
все возможные результаты арифметических операций**/
public class Ex_2 {

    int a = 10;
    int b = 2;
    public Ex_2(){
        System.out.println(a + b);
//пропущено вычитание
        System.out.println(a - b);
//пропущено умножение
        System.out.println(a * b);
//пропущено деление
        System.out.println(a / b);
    }

}
