//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {public static void main(String[] args) {

    System.out.println("Создать новый проект. Создать класс с методом main. В методе main написать код выводящий ваше ФИО, номер телефона, адрес");
    Ex_1 ex1 = new Ex_1();
    System.out.println("Создать приложение, в котором есть две целочисленные переменные (задаются в коде, не нужно считывать из консоли), и на экран необходимо вывести  все возможные результаты арифметических операций");
    Ex_2 ex2 = new Ex_2();
    System.out.println("Создать приложение для вычисления периметра прямоугольника.\n" +
            "В консоли вводятся длины двух сторон (целочисленные),\n" +
            "необходимо вывести периметр прямоугольника.");
    Ex_3 ex3 = new Ex_3();
    System.out.println("Создать приложение для вычисления площади треугольника.\n" +
            "Необходимо считать из консоли значения основания и высоты,\n" +
            "они могут быть вещественными. Вывести на консоль площадь треугольника");
    Ex_4 ex4 = new Ex_4();
    System.out.println("/*Создать приложение для вычисления площади квадрата.\n" +
            "Необходимо считать из консоли длину стороны квадрата и вывести его площадь.\n" +
            "*/");
    Ex_5 ex5 = new Ex_5();
    System.out.println("Создать приложение, которое будет делить вводимое число на 2,\n" +
            "на 5 и на 10. И выводить ответ на консоль.\n" +
            "Для этого задайте вводимому числу тип данных float");
    Ex_6 ex6 = new Ex_6();
    System.out.println("Создать приложение, которое будет делить вводимое число на 2,\n" +
            "на 5 и на 10. И выводить ответ на консоль.\n" +
            "Для этого задайте вводимому числу тип данных float");
    Ex_6_1 ex_6_1 = new Ex_6_1();
    System.out.println("Создать приложение, которое будет просчитывать примерное время ожидания в\n" +
            "очереди на приёме к врачу. Известно, что врач тратит минимум 10 минут на\n" +
            "приём одного пациента, а максимум 20. С консоли вводится количество пациентов в\n" +
            "очереди, необходимо вывести минимальное, максимальное и среднее время ожидания в очереди.");
    Ex_7 ex7 = new Ex_7();
    System.out.println("Создать приложение для проведения выборов. С консоли вводится 2 числа: количество\n" +
            "проголосовавших за первого и второго кандидата на выборах. Нужно вывести процент\n" +
            "голосов которые были отданы за первого и второго кандидата соответственно.\n" +
            "Например, при входных данных: 1 4 . Ответ будет: 20% 80%");
    Ex_8 ex8 = new Ex_8();
    System.out.println("Создать приложение для вычисления минимального значение из трёх введённых переменных.\n" +
            "Пользователь вводит три переменные, нужно вывести минимальное значение.\n" +
            "Для реализации задачи воспользоваться библиотекой Math.");
    Ex_9 ex9 = new Ex_9();
    System.out.println("Создать приложение, которое будет решать следующую задачу. На консоль вводится 4 числа\n" +
            "— зарплаты сотрудников IT отделов. Нужно вывести на экран разницу между наибольшей и\n" +
            "наименьшей зарплатой в отделе.");
    Ex_10 ex10 = new Ex_10();
    }

}